Revit 2027 API
WorksharingUtils.CheckoutElements Method
Overload List
Name | Description
CheckoutElements(Document, ICollection<ElementId>) |  Obtains ownership for the current user of as many specified elements as possible.
CheckoutElements(Document, ISet<ElementId>, TransactWithCentralOptions) |  Obtains ownership for the current user of as many specified elements as possible.
Top
See Also
Reference
WorksharingUtils Class
Autodesk.Revit.DB Namespace